g/h/Steps.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Steps</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-11-14 14:27:15 EST"/>
<meta name="author" content="Greg"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">Steps</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Logical Steps </a>
<ul>
<li><a href="#sec-1.1">1.1 Introduction </a></li>
<li><a href="#sec-1.2">1.2 Division of the Logic (steps) </a>
<ul>
<li><a href="#sec-1.2.1">1.2.1 Objective Logic (1-52) </a></li>
<li><a href="#sec-1.2.2">1.2.2 Subjective Logic (53-79) </a></li>
</ul>
</li>
<li><a href="#sec-1.3">1.3 Steps </a>
<ul>
<li><a href="#sec-1.3.1">1.3.1 Quality (1-10) </a></li>
<li><a href="#sec-1.3.2">1.3.2 Quantity (11-17) </a></li>
<li><a href="#sec-1.3.3">1.3.3 Measure (18-23) </a></li>
<li><a href="#sec-1.3.4">1.3.4 Reflection (24-33) </a></li>
<li><a href="#sec-1.3.5">1.3.5 Appearance (34-42) </a></li>
<li><a href="#sec-1.3.6">1.3.6 Actuality (43-52) </a></li>
<li><a href="#sec-1.3.7">1.3.7 Subjectivity (53-62) </a></li>
<li><a href="#sec-1.3.8">1.3.8 Objectivity (63-71) </a></li>
<li><a href="#sec-1.3.9">1.3.9 Idea (71-79) </a></li>
</ul>
</li>
<li><a href="#sec-1.4">1.4 Transitions </a>
<ul>
<li><a href="#sec-1.4.1">1.4.1 2a: (-&gt; 7 1) page 48. Understanding (as such) </a></li>
<li><a href="#sec-1.4.2">1.4.2 3a: (-&gt; (4 5 6) 1) p.70. Mediation </a></li>
<li><a href="#sec-1.4.3">1.4.3 8a: (-&gt; (4 5 6 7) 1) p.104. Speculative Reason </a></li>
</ul>
</li>
<li><a href="#sec-1.5">1.5 Resources </a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Logical Steps </h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1.1" class="outline-3">
<h3 id="sec-1.1"><span class="section-number-3">1.1</span> Introduction </h3>
<div class="outline-text-3" id="text-1.1">

<p>This document lays out the steps developed by David
Gray Carlson in his work on the <i>Science of Logic</i> (SL). <sup><a class="footref" name="fnr.1" href="#fn.1">1</a></sup>
</p>
<p>
According to Carlson, the "major contribution" of
his book is that "it reduces every move in Hegel's
logic to a discrete diagram." (4) 
</p>
<p>
In all, there are precisely 79 official logical
progressions, organized in groups of three.
</p>
<p>
Each official move is diagrammed in a "Figure". Thus
Figure 1(c) (Becoming) is the third sub-step of the
first step of the Logic.
</p>
<p>
There are a handful of "unofficial" steps in the Logic
used by Hegel and Carlson to clarify certain details
in the progression of the Logic.
</p>
<p>
The the terms referring to the official steps of the
Logic will be capitalized. 
</p>
<p>
Carlson uses the AV Miller translation as his main
source.
</p></div>

</div>

<div id="outline-container-1.2" class="outline-3">
<h3 id="sec-1.2"><span class="section-number-3">1.2</span> Division of the Logic (steps) </h3>
<div class="outline-text-3" id="text-1.2">


</div>

<div id="outline-container-1.2.1" class="outline-4">
<h4 id="sec-1.2.1"><span class="section-number-4">1.2.1</span> Objective Logic (1-52) </h4>
<div class="outline-text-4" id="text-1.2.1">

<ul>
<li id="sec-1.2.1.1">Doctrine of Being (1-23) <br/>
<ul>
<li id="sec-1.2.1.1.1">Quality (1-10) <br/>
</li>
<li id="sec-1.2.1.1.2">Quantity (11-17) <br/>
</li>
<li id="sec-1.2.1.1.3">Measure (18-23) <br/>
</li>
</ul>
</li>
<li id="sec-1.2.1.2">Doctrine of Essence (24-52) <br/>
<ul>
<li id="sec-1.2.1.2.1">Reflection (24-33) <br/>
</li>
<li id="sec-1.2.1.2.2">Appearance (34-42) <br/>
</li>
<li id="sec-1.2.1.2.3">Actuality (43-52) <br/>
</li>
</ul>
</li>
</ul>
</div>

</div>

<div id="outline-container-1.2.2" class="outline-4">
<h4 id="sec-1.2.2"><span class="section-number-4">1.2.2</span> Subjective Logic (53-79) </h4>
<div class="outline-text-4" id="text-1.2.2">

<ul>
<li id="sec-1.2.2.1">Doctrine of Concept (53-79) <br/>
<ul>
<li id="sec-1.2.2.1.1">Subjectivity (53-62) <br/>
</li>
<li id="sec-1.2.2.1.2">Objectivity (63-71) <br/>
</li>
<li id="sec-1.2.2.1.3">Idea (71-79) <br/>
</li>
</ul>
</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-1.3" class="outline-3">
<h3 id="sec-1.3"><span class="section-number-3">1.3</span> Steps </h3>
<div class="outline-text-3" id="text-1.3">


</div>

<div id="outline-container-1.3.1" class="outline-4">
<h4 id="sec-1.3.1"><span class="section-number-4">1.3.1</span> Quality (1-10) </h4>
<div class="outline-text-4" id="text-1.3.1">

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col align="right" /><col align="left" /><col align="left" /><col align="left" />
</colgroup>
<thead>
<tr><th scope="col">Step</th><th scope="col">Substep a</th><th scope="col">Substep b</th><th scope="col">Substep c</th></tr>
</thead>
<tbody>
<tr><td>1</td><td>Pure Being (11)</td><td>Pure Nothing (14)</td><td>Becoming (15)</td></tr>
<tr><td>2</td><td>Determinate Being (48)</td><td>Quality and Negation (58)</td><td>Something (63)</td></tr>
<tr><td>3</td><td>Something/Other (70)</td><td>Being-for-other/Being-in-itself (73)</td><td>Determination of the In-itself (78)</td></tr>
<tr><td>4</td><td>Constitution (79)</td><td>Constitution vs. Determination (82)</td><td>Limit (Determinateness as Such) (83)</td></tr>
<tr><td>5</td><td>Finitude (87)</td><td>Limitation (87)</td><td>The Ought (88)</td></tr>
<tr><td>6</td><td>Enriched Finite (92)</td><td>Another Finite (92)</td><td>Infinity (93)</td></tr>
<tr><td>7</td><td>Spurious Infinity (94)</td><td>Spurious Infinity and Its Other (94)</td><td>True Infinity (97)</td></tr>
<tr><td>8</td><td>Being-for-self (104)</td><td>Being-For-One (106)</td><td>The One (110)</td></tr>
<tr><td>9</td><td>The One in Its Own Self (111)</td><td>The One and the Void (112)</td><td>Repulsion (120)</td></tr>
<tr><td>10</td><td>Attraction (121)</td><td>Repulsion and Attraction (125)</td><td>Quantity (132)</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-1.3.2" class="outline-4">
<h4 id="sec-1.3.2"><span class="section-number-4">1.3.2</span> Quantity (11-17) </h4>
<div class="outline-text-4" id="text-1.3.2">

</div>

</div>

<div id="outline-container-1.3.3" class="outline-4">
<h4 id="sec-1.3.3"><span class="section-number-4">1.3.3</span> Measure (18-23) </h4>
<div class="outline-text-4" id="text-1.3.3">

</div>

</div>

<div id="outline-container-1.3.4" class="outline-4">
<h4 id="sec-1.3.4"><span class="section-number-4">1.3.4</span> Reflection (24-33) </h4>
<div class="outline-text-4" id="text-1.3.4">

</div>

</div>

<div id="outline-container-1.3.5" class="outline-4">
<h4 id="sec-1.3.5"><span class="section-number-4">1.3.5</span> Appearance (34-42) </h4>
<div class="outline-text-4" id="text-1.3.5">

</div>

</div>

<div id="outline-container-1.3.6" class="outline-4">
<h4 id="sec-1.3.6"><span class="section-number-4">1.3.6</span> Actuality (43-52) </h4>
<div class="outline-text-4" id="text-1.3.6">

</div>

</div>

<div id="outline-container-1.3.7" class="outline-4">
<h4 id="sec-1.3.7"><span class="section-number-4">1.3.7</span> Subjectivity (53-62) </h4>
<div class="outline-text-4" id="text-1.3.7">

</div>

</div>

<div id="outline-container-1.3.8" class="outline-4">
<h4 id="sec-1.3.8"><span class="section-number-4">1.3.8</span> Objectivity (63-71) </h4>
<div class="outline-text-4" id="text-1.3.8">

</div>

</div>

<div id="outline-container-1.3.9" class="outline-4">
<h4 id="sec-1.3.9"><span class="section-number-4">1.3.9</span> Idea (71-79) </h4>
<div class="outline-text-4" id="text-1.3.9">

</div>
</div>

</div>

<div id="outline-container-1.4" class="outline-3">
<h3 id="sec-1.4"><span class="section-number-3">1.4</span> Transitions </h3>
<div class="outline-text-3" id="text-1.4">

<p>The descriptions of the transitions involved in 2a, 3a and 8a
are provided on page 104.
</p>

</div>

<div id="outline-container-1.4.1" class="outline-4">
<h4 id="sec-1.4.1"><span class="section-number-4">1.4.1</span> 2a: (-&gt; 7 1) page 48. Understanding (as such) </h4>
<div class="outline-text-4" id="text-1.4.1">

<p>This transition represents the Understanding's focus on
the IMMEDIACY present in the middle term (7).
</p>
</div>

</div>

<div id="outline-container-1.4.2" class="outline-4">
<h4 id="sec-1.4.2"><span class="section-number-4">1.4.2</span> 3a: (-&gt; (4 5 6) 1) p.70. Mediation </h4>
<div class="outline-text-4" id="text-1.4.2">

<p>This transition represents the Understanding's focus on
the MEDIATION within the middle term.
</p>
</div>

</div>

<div id="outline-container-1.4.3" class="outline-4">
<h4 id="sec-1.4.3"><span class="section-number-4">1.4.3</span> 8a: (-&gt; (4 5 6 7) 1) p.104. Speculative Reason </h4>
<div class="outline-text-4" id="text-1.4.3">

<p>This transition represents the Understanding's focus on
the UNITY of IMMEDIACY and MEDIATION.
</p></div>
</div>

</div>

<div id="outline-container-1.5" class="outline-3">
<h3 id="sec-1.5"><span class="section-number-3">1.5</span> Resources </h3>
<div class="outline-text-3" id="text-1.5">

<p>Carlson, David Gray. "A Commentary to Hegel's 
<i>Science of Logic</i>". 2007. New York: Palgrave
MacMillan.
</p>
<p>
Hegel, GWF. "The Science of Logic". AV Miller
Translation. 
</p>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">
<p class="footnote"><sup><a class="footnum" name="fn.1" href="#fnr.1">1</a></sup> The term "<i>SL</i>" refers to the book by Hegel, while 
the term "Logic" refers to the content of the book.
</p>
</div>
</div>
<div id="postamble">
<p class="author"> Author: Greg
<a href="mailto:greg@greg-Satellite-C855D">&lt;greg@greg-Satellite-C855D&gt;</a>
</p>
<p class="date"> Date: 2013-11-14 14:27:15 EST</p>
<p class="creator">HTML generated by org-mode 6.33x in emacs 23</p>
</div>
</div>
</body>
</html>
